---
kind: other
id: Methods.T:Autodesk.Revit.Creation.FamilyItemFactory
source: html/9c5b5ade-9506-f1fa-6228-efbf99f97ef6.htm
---
# FamilyItemFactory Methods

Causes the object to release immediately any resources it may be utilizing.